KarstenHervoeHansen/PTV/PT8643/MCU/PT8643_BL/C8051F120_defs.h
//-----------------------------------------------------------------------------
// C8051F120_defs.h
//-----------------------------------------------------------------------------
// Copyright 2008, Silicon Laboratories, Inc.
// http://www.silabs.com
//
// Program Description:
//
// Register/bit definitions for the C8051F12x family.
// **Important Note**: The compiler_defs.h header file should be included
// before including this header file.
//
// Target:         C8051F120, 'F121, 'F122, 'F123, 'F124, 'F125, 'F126, 'F127,
//                 'F130, 'F131, 'F132, 'F133
// Tool chain:     Generic
// Command Line:   None
//
// Release 1.2 - 21 July 2008 (ES)
//    -Added P6 and MAC0STA to bit-addressable registers
// Release 1.1 - 07 AUG 2007 (PKC)
//    -Removed #include <compiler_defs.h>. The C source file should include it.
//    -Corrected preprocessor directive to C8051F120_DEFS_H
// Release 1.0 - 08 DEC 2006 (BW)
//    -Ported from 'F360 DEFS rev 1.1

//-----------------------------------------------------------------------------
// Header File Preprocessor Directive
//-----------------------------------------------------------------------------

#ifndef C8051F120_DEFS_H
#define C8051F120_DEFS_H

//-----------------------------------------------------------------------------
// Byte Registers
//-----------------------------------------------------------------------------

SFR (P0, 0x80);                        // Port 0 Latch
SFR (SP, 0x81);                        // Stack Pointer
SFR (DPL, 0x82);                       // Data Pointer Low
SFR (DPH, 0x83);                       // Data Pointer High
SFR (SFRPAGE, 0x84);                   // SFR Page Select
SFR (SFRNEXT, 0x85);                   // SFR stack next page
SFR (SFRLAST, 0x86);                   // SFR stack last page
SFR (PCON, 0x87);                      // Power Control
SFR (TCON, 0x88);                      // Timer/Counter Control
SFR (CPT0CN, 0x88);                    // Comparator1 Control
SFR (CPT1CN, 0x88);                    // Comparator0 Control
SFR (FLSTAT, 0x88);                    // Flash Status
SFR (TMOD, 0x89);                      // Timer/Counter Mode
SFR (CPT0MD, 0x89);                    // Comparator0 Mode
SFR (CPT1MD, 0x89);                    // Comparator1 Mode
SFR (PLL0CN, 0x89);                    // PLL0 Control
SFR (TL0, 0x8A);                       // Timer/Counter 0 Low
SFR (OSCICN, 0x8A);                    // Internal Oscillator Control
SFR (TL1, 0x8B);                       // Timer/Counter 1 Low
SFR (OSCICL, 0x8B);                    // Internal Oscillator Calibration
SFR (TH0, 0x8C);                       // Timer/Counter 0 High
SFR (OSCXCN, 0x8C);                    // External Oscillator Control
SFR (TH1, 0x8D);                       // Timer/Counter 1 High
SFR (PLL0DIV, 0x8D);                   // PLL0 Divider
SFR (CKCON, 0x8E);                     // Clock Control
SFR (PLL0MUL, 0x8E);                   // PLL0 Multiplier
SFR (PSCTL, 0x8F);                     // Program Store R/W Control
SFR (PLL0FLT, 0x8F);                   // PLL0 Filter
SFR (P1, 0x90);                        // Port 1 Latch
SFR (SSTA0, 0x91);                     // UART0 Status
SFR (MAC0BL, 0x91);                    // MAC0 B Low Byte
SFR (MAC0BH, 0x92);                    // MAC0 B High Byte
SFR (MAC0ACC0, 0x93);                  // MAC0 Accumulator Byte 0
SFR (MAC0ACC1, 0x94);                  // MAC0 Accumulator Byte 1
SFR (MAC0ACC2, 0x95);                  // MAC0 Accumulator Byte 2
SFR (MAC0ACC3, 0x96);                  // MAC0 Accumulator Byte 3
SFR (SFRPGCN, 0x96);                   // SFR Page Control
SFR (CLKSEL, 0x97);                    // System clock select
SFR (MAC0OVR, 0x97);                   // MAC0 Accumulator Overflow
SFR (SCON0, 0x98);                     // UART0 Control
SFR (SCON, 0x98);                      // UART0 Control
SFR (SCON1, 0x98);                     // UART1 Control
SFR (SBUF0, 0x99);                     // UART0 Data Buffer
SFR (SBUF, 0x99);                      // UART0 Data Buffer
SFR (SBUF1, 0x99);                     // UART1 Data Buffer
SFR (SPI0CFG, 0x9A);                   // SPI0 Configuration
SFR (CCH0MA, 0x9A);                    // Cache Miss Accumulator
SFR (SPI0DAT, 0x9B);                   // SPI0 Data
SFR (P4MDOUT, 0x9C);                   // Port 4 Output Mode
SFR (SPI0CKR, 0x9D);                   // SPI0 Clock rate control
SFR (P5MDOUT, 0x9D);                   // Port 5 Output Mode
SFR (P6MDOUT, 0x9E);                   // Port 6 Output Mode
SFR (P7MDOUT, 0x9F);                   // Port 7 Output Mode
SFR (P2, 0xA0);                        // Port 2 Latch
SFR (EMI0TC, 0xA1);                    // EMIF Timing control
SFR (CCH0CN, 0xA1);                    // Cache control
SFR (EMI0CN, 0xA2);                    // EMIF control
SFR (CCH0TN, 0xA2);                    // Cache tuning
SFR (EMI0CF, 0xA3);                    // EMIF configuration
SFR (CCH0LC, 0xA3);                    // Cache lock
SFR (P0MDOUT, 0xA4);                   // Port 0 Output Mode
SFR (P1MDOUT, 0xA5);                   // Port 1 Output Mode
SFR (P2MDOUT, 0xA6);                   // Port 2 Output Mode
SFR (P3MDOUT, 0xA7);                   // Port 3 Output Mode
SFR (IE, 0xA8);                        // Interrupt Enable
SFR (SADDR0, 0xA9);                    // UART0 Slave address
SFR (P1MDIN, 0xAD);                    // Port 1 Analog Input Mode
SFR (P3, 0xB0);                        // Port 3 Latch
SFR (PSBANK, 0xB1);                    // Flash bank select
SFR (FLSCL, 0xB7);                     // Flash scale
SFR (FLACL, 0xB7);                     // Flash access limit
SFR (IP, 0xB8);                        // Interrupt Priority
SFR (SADEN0, 0xB9);                    // UART0 Slave address mask
SFR (AMX0CF, 0xBA);                    // AMUX0 Channel configuration
SFR (AMX2CF, 0xBA);                    // AMUX2 Channel configuration
SFR (AMX0SL, 0xBB);                    // AMUX0 Channel select
SFR (AMX2SL, 0xBB);                    // AMUX2 Channel select
SFR (ADC0CF, 0xBC);                    // ADC0 Configuration
SFR (ADC2CF, 0xBC);                    // ADC2 Configuration
SFR (ADC0L, 0xBE);                     // ADC0 Data Low
SFR (ADC2, 0xBE);                      // ADC2 Data
SFR (ADC0H, 0xBF);                     // ADC0 Data High
SFR (SMB0CN, 0xC0);                    // SMBus0 Control
SFR (MAC0STA, 0xC0);                   // MAC0 Status
SFR (SMB0STA, 0xC1);                   // SMBus0 Status
SFR (MAC0AL, 0xC1);                    // MAC0 A Low Byte
SFR (SMB0DAT, 0xC2);                   // SMBus0 Data
SFR (MAC0AH, 0xC2);                    // MAC0 A High Byte
SFR (SMB0ADR, 0xC3);                   // SMBus0 Slave address
SFR (MAC0CF, 0xC3);                    // MAC0 Configuration
SFR (ADC0GTL, 0xC4);                   // ADC0 Greater-Than Compare Low
SFR (ADC2GT, 0xC4);                    // ADC2 Greater-Than Compare
SFR (ADC0GTH, 0xC5);                   // ADC0 Greater-Than Compare High
SFR (ADC0LTL, 0xC6);                   // ADC0 Less-Than Compare Word Low
SFR (ADC2LT, 0xC6);                    // ADC2 Less-Than Compare Word
SFR (ADC0LTH, 0xC7);                   // ADC0 Less-Than Compare Word High
SFR (TMR2CN, 0xC8);                    // Timer/Counter 2 Control
SFR (TMR3CN, 0xC8);                    // Timer/Counter 3 Control
SFR (TMR4CN, 0xC8);                    // Timer/Counter 4 Control
SFR (P4, 0xC8);                        // Port 4 Latch
SFR (TMR2CF, 0xC9);                    // Timer/Counter 2 Configuration
SFR (TMR3CF, 0xC9);                    // Timer/Counter 3 Configuration
SFR (TMR4CF, 0xC9);                    // Timer/Counter 4 Configuration
SFR (RCAP2L, 0xCA);                    // Timer/Counter 2 Reload Low
SFR (RCAP3L, 0xCA);                    // Timer/Counter 3 Reload Low
SFR (RCAP4L, 0xCA);                    // Timer/Counter 4 Reload Low
SFR (RCAP2H, 0xCB);                    // Timer/Counter 2 Reload High
SFR (RCAP3H, 0xCB);                    // Timer/Counter 3 Reload High
SFR (RCAP4H, 0xCB);                    // Timer/Counter 4 Reload High
SFR (TMR2L, 0xCC);                     // Timer/Counter 2 Low
SFR (TMR3L, 0xCC);                     // Timer/Counter 3 Low
SFR (TMR4L, 0xCC);                     // Timer/Counter 4 Low
SFR (TMR2H, 0xCD);                     // Timer/Counter 2 High
SFR (TMR3H, 0xCD);                     // Timer/Counter 3 High
SFR (TMR4H, 0xCD);                     // Timer/Counter 4 High
SFR (MAC0RNDL, 0xCE);                  // MAC0 Rounding Register Low Byte
SFR (SMB0CR, 0xCF);                    // SMBus0 Clock Rate
SFR (MAC0RNDH, 0xCF);                  // MAC0 Rounding Register High Byte
SFR (PSW, 0xD0);                       // Program Status Word
SFR (REF0CN, 0xD1);                    // Voltage Reference Control
SFR (DAC0L, 0xD2);                     // DAC0 Data Low
SFR (DAC1L, 0xD2);                     // DAC1 Data Low
SFR (DAC0H, 0xD3);                     // DAC0 Data High
SFR (DAC1H, 0xD3);                     // DAC1 Data High
SFR (DAC0CN, 0xD4);                    // DAC0 Control
SFR (DAC1CN, 0xD4);                    // DAC2 Control
SFR (PCA0CN, 0xD8);                    // PCA0 Control
SFR (P5, 0xD8);                        // Port 5 Latch
SFR (PCA0MD, 0xD9);                    // PCA0 Mode
SFR (PCA0CPM0, 0xDA);                  // PCA0 Module 0 Mode Register
SFR (PCA0CPM1, 0xDB);                  // PCA0 Module 1 Mode Register
SFR (PCA0CPM2, 0xDC);                  // PCA0 Module 2 Mode Register
SFR (PCA0CPM3, 0xDD);                  // PCA0 Module 3 Mode Register
SFR (PCA0CPM4, 0xDE);                  // PCA0 Module 4 Mode Register
SFR (PCA0CPM5, 0xDF);                  // PCA0 Module 5 Mode Register
SFR (ACC, 0xE0);                       // Accumulator
SFR (PCA0CPL5, 0xE1);                  // PCA0 Module 5 Capture/Compare Low
SFR (XBR0, 0xE1);                      // Port I/O Crossbar Control 0
SFR (PCA0CPH5, 0xE2);                  // PCA0 Module 5 Capture/Compare High
SFR (XBR1, 0xE2);                      // Port I/O Crossbar Control 1
SFR (XBR2, 0xE3);                      // Port I/O Crossbar Control 2
SFR (EIE1, 0xE6);                      // Extended Interrupt Enable 1
SFR (EIE2, 0xE7);                      // Extended Interrupt Enable 2
SFR (ADC0CN, 0xE8);                    // ADC0 Control
SFR (ADC2CN, 0xE8);                    // ADC2 Control
SFR (P6, 0xE8);                        // Port 6 Latch
SFR (PCA0CPL2, 0xE9);                  // PCA0 Capture 2 Low
SFR (PCA0CPH2, 0xEA);                  // PCA0 Capture 2 High
SFR (PCA0CPL3, 0xEB);                  // PCA0 Capture 3 Low
SFR (PCA0CPH3, 0xEC);                  // PCA0 Capture 3 High
SFR (PCA0CPL4, 0xED);                  // PCA0 Capture 4 Low
SFR (PCA0CPH4, 0xEE);                  // PCA0 Capture 4 High
SFR (RSTSRC, 0xEF);                    // Reset Source Configuration/Status
SFR (B, 0xF0);                         // B Register
SFR (EIP1, 0xF6);                      // External Interrupt Priority 1
SFR (EIP2, 0xF7);                      // External Interrupt Priority 2
SFR (SPI0CN, 0xF8);                    // SPI0 Control
SFR (P7, 0xF8);                        // Port 7 Latch
SFR (PCA0L, 0xF9);                     // PCA0 Counter Low
SFR (PCA0H, 0xFA);                     // PCA0 Counter High
SFR (PCA0CPL0, 0xFB);                  // PCA0 Capture 0 Low
SFR (PCA0CPH0, 0xFC);                  // PCA0 Capture 0 High
SFR (PCA0CPL1, 0xFD);                  // PCA0 Capture 1 Low
SFR (PCA0CPH1, 0xFE);                  // PCA0 Capture 1 High
SFR (WDTCN, 0xFF);                     // Watchdog Timer Control

