KarstenHervoeHansen/PTV/PT8643/MCU/PT8643_BL/C8051F120_defs.h
//-----------------------------------------------------------------------------
// 16-bit Register Definitions (might not be supported by all compilers)
//-----------------------------------------------------------------------------

SFR16 (DP, 0x82);                      // Data Pointer
SFR16 (MAC0B, 0x91);                   // MAC0B data register
SFR16 (MAC0ACCL, 0x93);                // MAC0ACC low registers
SFR16 (MAC0ACCH, 0x95);                // MAC0ACC high registers
SFR16 (ADC0, 0xbe);                    // ADC0 data
SFR16 (MAC0A, 0xc1);                   // MAC0A data register
SFR16 (ADC0GT, 0xc4);                  // ADC0 greater than window
SFR16 (ADC0LT, 0xc6);                  // ADC0 less than window
SFR16 (RCAP2, 0xca);                   // Timer2 capture/reload
SFR16 (RCAP3, 0xca);                   // Timer3 capture/reload
SFR16 (RCAP4, 0xca);                   // Timer4 capture/reload
SFR16 (TMR2, 0xcc);                    // Timer2
SFR16 (TMR3, 0xcc);                    // Timer3
SFR16 (TMR4, 0xcc);                    // Timer4
SFR16 (MAC0RND, 0xce);                 // MAC0RND registers
SFR16 (DAC0, 0xd2);                    // DAC0 data
SFR16 (DAC1, 0xd2);                    // DAC1 data
SFR16 (PCA0CP5, 0xe1);                 // PCA0 Module 5 capture
SFR16 (PCA0CP2, 0xe9);                 // PCA0 Module 2 capture
SFR16 (PCA0CP3, 0xeb);                 // PCA0 Module 3 capture
SFR16 (PCA0CP4, 0xed);                 // PCA0 Module 4 capture
SFR16 (PCA0, 0xf9);                    // PCA0 counter
SFR16 (PCA0CP0, 0xfb);                 // PCA0 Module 0 capture
SFR16 (PCA0CP1, 0xfd);                 // PCA0 Module 1 capture

//-----------------------------------------------------------------------------
// Address Definitions for Bit-addressable Registers
//-----------------------------------------------------------------------------

#define SFR_P0       0x80
#define SFR_TCON     0x88
#define SFR_CPT0CN   0x88
#define SFR_CPT1CN   0x88
#define SFR_FLSTAT   0x88
#define SFR_P1       0x90
#define SFR_SCON0    0x98
#define SFR_SCON     0x98
#define SFR_SCON1    0x98
#define SFR_P2       0xA0
#define SFR_IE       0xA8
#define SFR_P3       0xB0
#define SFR_IP       0xB8
#define SFR_SMB0CN   0xC0
#define SFR_MAC0STA  0xC0
#define SFR_TMR2CN   0xC8
#define SFR_TMR3CN   0xC8
#define SFR_TMR4CN   0xC8
#define SFR_P4       0xC8
#define SFR_PSW      0xD0
#define SFR_PCA0CN   0xD8
#define SFR_P5       0xD8
#define SFR_ACC      0xE0
#define SFR_ADC0CN   0xE8
#define SFR_ADC2CN   0xE8
#define SFR_P6	     0xE8
#define SFR_B        0xF0
#define SFR_SPI0CN   0xF8
#define SFR_P7       0xF8

//-----------------------------------------------------------------------------
// Bit Definitions
//-----------------------------------------------------------------------------

// TCON 0x88
SBIT (TF1, SFR_TCON, 7);               // Timer 1 Overflow Flag
SBIT (TR1, SFR_TCON, 6);               // Timer 1 On/Off Control
SBIT (TF0, SFR_TCON, 5);               // Timer 0 Overflow Flag
SBIT (TR0, SFR_TCON, 4);               // Timer 0 On/Off Control
SBIT (IE1, SFR_TCON, 3);               // Ext. Interrupt 1 Edge Flag
SBIT (IT1, SFR_TCON, 2);               // Ext. Interrupt 1 Type
SBIT (IE0, SFR_TCON, 1);               // Ext. Interrupt 0 Edge Flag
SBIT (IT0, SFR_TCON, 0);               // Ext. Interrupt 0 Type

// CPT0CN  0x88
SBIT (CP0EN, SFR_CPT0CN, 7);           // Comparator 0 Enable
SBIT (CP0OUT, SFR_CPT0CN, 6);          // Comparator 0 Output
SBIT (CP0RIF, SFR_CPT0CN, 5);          // Comparator 0 Rising Edge Interrupt
SBIT (CP0FIF, SFR_CPT0CN, 4);          // Comparator 0 Falling Edge Interrupt
SBIT (CP0HYP1, SFR_CPT0CN, 3);         // Comparator 0 Positive Hysteresis 1
SBIT (CP0HYP0, SFR_CPT0CN, 2);         // Comparator 0 Positive Hysteresis 0
SBIT (CP0HYN1, SFR_CPT0CN, 1);         // Comparator 0 Negative Hysteresis 1
SBIT (CP0HYN0, SFR_CPT0CN, 0);         // Comparator 0 Negative Hysteresis 0

// CPT1CN  0x88
SBIT (CP1EN, SFR_CPT1CN, 7);           // Comparator 1 Enable
SBIT (CP1OUT, SFR_CPT1CN, 6);          // Comparator 1 Output
SBIT (CP1RIF, SFR_CPT1CN, 5);          // Comparator 1 Rising Edge Interrupt
SBIT (CP1FIF, SFR_CPT1CN, 4);          // Comparator 1 Falling Edge Interrupt
SBIT (CP1HYP1, SFR_CPT1CN, 3);         // Comparator 1 Positive Hysteresis 1
SBIT (CP1HYP0, SFR_CPT1CN, 2);         // Comparator 1 Positive Hysteresis 0
SBIT (CP1HYN1, SFR_CPT1CN, 1);         // Comparator 1 Negative Hysteresis 1
SBIT (CP1HYN0, SFR_CPT1CN, 0);         // Comparator 1 Negative Hysteresis 0

// FLSTAT  0x88
SBIT (FLBUSY, SFR_FLSTAT, 0);          // FLASH Busy

// SCON0 0x98
SBIT (SM00, SFR_SCON0, 7);             // UART0 Mode 0
SBIT (SM10, SFR_SCON0, 6);             // UART0 Mode 1
SBIT (SM20, SFR_SCON0, 5);             // UART0 Multiprocessor enable
SBIT (REN0, SFR_SCON0, 4);             // UART0 RX Enable
SBIT (REN, SFR_SCON0, 4);              // UART0 RX Enable
SBIT (TB80, SFR_SCON0, 3);             // UART0 TX Bit 8
SBIT (TB8, SFR_SCON0, 3);              // UART0 TX Bit 8
SBIT (RB80, SFR_SCON0, 2);             // UART0 RX Bit 8
SBIT (RB8, SFR_SCON0, 2);              // UART0 RX Bit 8
SBIT (TI0, SFR_SCON0, 1);              // UART0 TX Interrupt Flag
SBIT (TI, SFR_SCON0, 1);               // UART0 TX Interrupt Flag
SBIT (RI0, SFR_SCON0, 0);              // UART0 RX Interrupt Flag
SBIT (RI, SFR_SCON0, 0);               // UART0 RX Interrupt Flag

// SCON1 0x98
SBIT (S1MODE, SFR_SCON1, 7);           // UART1 Mode
                                       // Bit6 UNUSED
SBIT (MCE1, SFR_SCON1, 5);             // UART1 MCE
SBIT (REN1, SFR_SCON1, 4);             // UART1 RX Enable
SBIT (TB81, SFR_SCON1, 3);             // UART1 TX Bit 8
SBIT (RB81, SFR_SCON1, 2);             // UART1 RX Bit 8
SBIT (TI1, SFR_SCON1, 1);              // UART1 TX Interrupt Flag
SBIT (RI1, SFR_SCON1, 0);              // UART1 RX Interrupt Flag


// IE 0xA8
SBIT (EA, SFR_IE, 7);                  // Global Interrupt Enable
                                       // Bit 6 unused
SBIT (ET2, SFR_IE, 5);                 // Timer 2 Interrupt Enable
SBIT (ES0, SFR_IE, 4);                 // UART0 Interrupt Enable
SBIT (ET1, SFR_IE, 3);                 // Timer 1 Interrupt Enable
SBIT (EX1, SFR_IE, 2);                 // External Interrupt 1 Enable
SBIT (ET0, SFR_IE, 1);                 // Timer 0 Interrupt Enable
SBIT (EX0, SFR_IE, 0);                 // External Interrupt 0 Enable

// IP 0xB8
                                       // Bit 7 unused
                                       // Bit 6 unused
SBIT (PT2, SFR_IP, 5);                 // Timer 2 Priority
SBIT (PS0, SFR_IP, 4);                 // UART0 Priority
SBIT (PS, SFR_IP, 4);                  // UART0 Priority
SBIT (PT1, SFR_IP, 3);                 // Timer 1 Priority
SBIT (PX1, SFR_IP, 2);                 // External Interrupt 1 Priority
SBIT (PT0, SFR_IP, 1);                 // Timer 0 Priority
SBIT (PX0, SFR_IP, 0);                 // External Interrupt 0 Priority

// SMB0CN 0xC0
SBIT (BUSY, SFR_SMB0CN, 7);            // SMBus0 Busy
SBIT (ENSMB, SFR_SMB0CN, 6);           // SMBus0 Enable
SBIT (STA, SFR_SMB0CN, 5);             // SMBus0 Start Flag
SBIT (STO, SFR_SMB0CN, 4);             // SMBus0 Stop Flag
SBIT (SI, SFR_SMB0CN, 3);              // SMBus0 Interrupt pending
SBIT (AA, SFR_SMB0CN, 2);              // SMBus0 Assert/Ack Flag
SBIT (SMBFTE, SFR_SMB0CN, 1);          // SMBus0 Bus free timeout enable
SBIT (SMBTOE, SFR_SMB0CN, 0);          // SMBus0 SCL low timeout enable

// TMR2CN 0xC8
SBIT (TF2, SFR_TMR2CN, 7);             // Timer2 Overflow
SBIT (EXF2, SFR_TMR2CN, 6);            // Timer2 External
                                       // Bit 5 unused
                                       // Bit 4 unused
SBIT (EXEN2, SFR_TMR2CN, 3);           // Timer2 External Enable
SBIT (TR2, SFR_TMR2CN, 2);             // Timer2 Run Enable
SBIT (CT2, SFR_TMR2CN, 1);             // Timer2 Counter select
SBIT (CPRL2, SFR_TMR2CN, 0);           // Timer2 Capture select

