KarstenHervoeHansen/PTV/PT8643/MCU/PT8643_BL/C8051F120_defs.h
// TMR3CN 0xC8
SBIT (TF3, SFR_TMR3CN, 7);             // Timer3 Overflow
SBIT (EXF3, SFR_TMR3CN, 6);            // Timer3 External
                                       // Bit 5 unused
                                       // Bit 4 unused
SBIT (EXEN3, SFR_TMR3CN, 3);           // Timer3 External Enable
SBIT (TR3, SFR_TMR3CN, 2);             // Timer3 Run Enable
SBIT (CT3, SFR_TMR3CN, 1);             // Timer3 Counter select
SBIT (CPRL3, SFR_TMR3CN, 0);           // Timer3 Capture select

// TMR4CN 0xC8
SBIT (TF4, SFR_TMR4CN, 7);             // Timer4 Overflow
SBIT (EXF4, SFR_TMR4CN, 6);            // Timer4 External
                                       // Bit 5 unused
                                       // Bit 4 unused
SBIT (EXEN4, SFR_TMR4CN, 3);           // Timer4 External Enable
SBIT (TR4, SFR_TMR4CN, 2);             // Timer4 Run Enable
SBIT (CT4, SFR_TMR4CN, 1);             // Timer4 Counter select
SBIT (CPRL4, SFR_TMR4CN, 0);           // Timer4 Capture select

// PSW 0xD0
SBIT (CY, SFR_PSW, 7);                 // Carry Flag
SBIT (AC, SFR_PSW, 6);                 // Auxiliary Carry Flag
SBIT (F0, SFR_PSW, 5);                 // User Flag 0
SBIT (RS1, SFR_PSW, 4);                // Register Bank Select 1
SBIT (RS0, SFR_PSW, 3);                // Register Bank Select 0
SBIT (OV, SFR_PSW, 2);                 // Overflow Flag
SBIT (F1, SFR_PSW, 1);                 // User Flag 1
SBIT (P, SFR_PSW, 0);                  // Accumulator Parity Flag

// PCA0CN 0xD8
SBIT (CF, SFR_PCA0CN, 7);              // PCA0 Counter Overflow Flag
SBIT (CR, SFR_PCA0CN, 6);              // PCA0 Counter Run Control Bit
SBIT (CCF5, SFR_PCA0CN, 5);            // PCA0 Module 5 Interrupt Flag
SBIT (CCF4, SFR_PCA0CN, 4);            // PCA0 Module 4 Interrupt Flag
SBIT (CCF3, SFR_PCA0CN, 3);            // PCA0 Module 3 Interrupt Flag
SBIT (CCF2, SFR_PCA0CN, 2);            // PCA0 Module 2 Interrupt Flag
SBIT (CCF1, SFR_PCA0CN, 1);            // PCA0 Module 1 Interrupt Flag
SBIT (CCF0, SFR_PCA0CN, 0);            // PCA0 Module 0 Interrupt Flag

// ADC0CN 0xE8
SBIT (AD0EN, SFR_ADC0CN, 7);           // ADC0 Enable
SBIT (AD0TM, SFR_ADC0CN, 6);           // ADC0 Track Mode
SBIT (AD0INT, SFR_ADC0CN, 5);          // ADC0 EOC Interrupt Flag
SBIT (AD0BUSY, SFR_ADC0CN, 4);         // ADC0 Busy Flag
SBIT (AD0CM1, SFR_ADC0CN, 3);          // ADC0 Convert Start Mode Bit 1
SBIT (AD0CM0, SFR_ADC0CN, 2);          // ADC0 Convert Start Mode Bit 0
SBIT (AD0WINT, SFR_ADC0CN, 1);         // ADC0 Window Interrupt Flag
SBIT (AD0LJST, SFR_ADC0CN, 0);         // ADC0 Left Justify

// ADC2CN 0xE8
SBIT (AD2EN, SFR_ADC2CN, 7);           // ADC2 Enable
SBIT (AD2TM, SFR_ADC2CN, 6);           // ADC2 Track Mode
SBIT (AD2INT, SFR_ADC2CN, 5);          // ADC2 EOC Interrupt Flag
SBIT (AD2BUSY, SFR_ADC2CN, 4);         // ADC2 Busy Flag
SBIT (AD2CM2, SFR_ADC2CN, 3);          // ADC2 Convert Start Mode Bit 2
SBIT (AD2CM1, SFR_ADC2CN, 2);          // ADC2 Convert Start Mode Bit 1
SBIT (AD2CM0, SFR_ADC2CN, 1);          // ADC2 Convert Start Mode Bit 0
SBIT (AD2WINT, SFR_ADC2CN, 0);         // ADC2 Window Interrupt Flag

// SPI0CN 0xF8
SBIT (SPIF, SFR_SPI0CN, 7);            // SPI0 Interrupt Flag
SBIT (WCOL, SFR_SPI0CN, 6);            // SPI0 Write Collision Flag
SBIT (MODF, SFR_SPI0CN, 5);            // SPI0 Mode Fault Flag
SBIT (RXOVRN, SFR_SPI0CN, 4);          // SPI0 RX Overrun Flag
SBIT (NSSMD1, SFR_SPI0CN, 3);          // SPI0 Slave Select Mode 1
SBIT (NSSMD0, SFR_SPI0CN, 2);          // SPI0 Slave Select Mode 0
SBIT (TXBMT, SFR_SPI0CN, 1);           // SPI0 TX Buffer Empty Flag
SBIT (SPIEN, SFR_SPI0CN, 0);           // SPI0 Enable

//-----------------------------------------------------------------------------
// Interrupt Priorities
//-----------------------------------------------------------------------------

#define INTERRUPT_INT0             0   // External Interrupt 0
#define INTERRUPT_TIMER0           1   // Timer0 Overflow
#define INTERRUPT_INT1             2   // External Interrupt 1
#define INTERRUPT_TIMER1           3   // Timer1 Overflow
#define INTERRUPT_UART0            4   // UART0
#define INTERRUPT_TIMER2           5   // Timer2 Overflow
#define INTERRUPT_SPI0             6   // SPI0
#define INTERRUPT_SMBUS0           7   // SMBus0 Interface
#define INTERRUPT_ADC0_WINDOW      8   // ADC0 Window Comparison
#define INTERRUPT_PCA0             9   // PCA0 Peripheral
#define INTERRUPT_COMPARATOR0F     10  // Comparator0 Falling
#define INTERRUPT_COMPARATOR0R     11  // Comparator0 Rising
#define INTERRUPT_COMPARATOR1F     12  // Comparator1 Falling
#define INTERRUPT_COMPARATOR1R     13  // Comparator1 Rising
#define INTERRUPT_TIMER3           14  // Timer3 Overflow
#define INTERRUPT_ADC0_EOC         15  // ADC0 End Of Conversion
#define INTERRUPT_TIMER4           16  // Timer4 Overflow
#define INTERRUPT_ADC2_WINDOW      17  // ADC2 Window Comparison
#define INTERRUPT_ADC2_EOC         18  // ADC2 End Of Conversion
                                       // 19 - RESERVED
#define INTERRUPT_UART1            20  // UART1

//-----------------------------------------------------------------------------
// SFR Page Definitions
//-----------------------------------------------------------------------------

#define  CONFIG_PAGE       0x0F        // SYSTEM AND PORT CONFIGURATION PAGE
#define  LEGACY_PAGE       0x00        // LEGACY SFR PAGE
#define  TIMER01_PAGE      0x00        // TIMER0 AND TIMER1
#define  CPT0_PAGE         0x01        // COMPARATOR0
#define  CPT1_PAGE         0x02        // COMPARATOR1
#define  UART0_PAGE        0x00        // UART0
#define  UART1_PAGE        0x01        // UART1
#define  SPI0_PAGE         0x00        // SPI0
#define  EMI0_PAGE         0x00        // EMIF
#define  ADC0_PAGE         0x00        // ADC0
#define  ADC2_PAGE         0x02        // ADC2
#define  MAC0_PAGE         0x03        // MAC
#define  SMB0_PAGE         0x00        // SMBUS0
#define  TMR2_PAGE         0x00        // TIMER2
#define  TMR3_PAGE         0x01        // TIMER3
#define  TMR4_PAGE         0x02        // TIMER4
#define  DAC0_PAGE         0x00        // DAC0
#define  DAC1_PAGE         0x01        // DAC1
#define  PCA0_PAGE         0x00        // PCA0
#define  REF0_PAGE         0x00        // VREF0
#define  PLL0_PAGE         0x0F        // PLL0

//-----------------------------------------------------------------------------
// Header File PreProcessor Directive
//-----------------------------------------------------------------------------

#endif                                 // #define C8051F120_DEFS_H

//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------